Advanced_CFD_using_OpenFOAM/Pipe_using_blockMesh_only/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//scale   1; // 0.1;

convertToMeters 0.1;

vertices
(
    (0 2 0)
    (0 0 2)
    (0 -2 0)
    (0 0 -2)
    (20 2 0)
    (20 0 2)
    (20 -2 0)
    (20 0 -2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 40 100) simpleGrading (1 1 1)
);

edges
(
    arc 0 1 (0 1.414213562 1.414213562)
    arc 1 2 (0 -1.414213562 1.414213562)
    arc 2 3 (0 -1.414213562 -1.414213562)
    arc 3 0 (0 1.414213562 -1.414213562)

    arc 4 5 (20 1.414213562 1.414213562)
    arc 5 6 (20 -1.414213562 1.414213562)
    arc 6 7 (20 -1.414213562 -1.414213562)
    arc 7 4 (20 1.414213562 -1.414213562)
)

boundary
(
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (3 7 0 4)
        );
    }

    inlet
    {
        type inlet;
        faces
        (
            (0 1 2 3)
        );
    }

    outlet
    {
        type outlet;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);











// ************************************************************************* //
